#-*- mode: org -*-
#+TITLE=Main config file
#+STARTUP:overview

#+begin_quote
(What the world needs (I think) is not
      (a Lisp (with fewer parentheses))
      but (an English (with more.)))
-- Brian Hayes, http://tinyurl.com/3y9l2kf
#+end_quote

#+begin_quote
 Emacs is a flexible platform for developing end-user applications
   –unfortunately it is generally perceived as merely a text editor.
Some people use it specifically for one or two applications.
-- https://alhassy.github.io/init/
#+end_quote

#+begin_quote
I’m rarely happier than when spending an entire day programming my computer
  to perform automatically a task that would otherwise take me a
  good ten seconds to do by hand.
-- Douglas Adams
#+end_quote

#+begin_quote
“You don’t have to like Emacs to like it.”
-- https://www.gnu.org/software/emacs/manual/html_node/eintr/Emacs-Initialization.html
#+end_quote

*** Formater
#+begin_src elisp
(setq +format-on-save-enabled-modes
      '(not emacs-lisp-mode  ; elisp's mechanisms are good enough
            sql-mode         ; sqlformat is currently broken
            tex-mode         ; latexindent is broken
            c-mode
            latex-mode))
#+end_src

#+RESULTS:
| not | emacs-lisp-mode | sql-mode | tex-mode | c-mode | latex-mode |

*** Lookup online
- Thresauros for synonyms.
#+begin_src elisp
(setq +lookup-provider-url-alist
      '(;; ("Doom Emacs issues" "https://github.com/hlissner/doom-emacs/issues?q=is%%3Aissue+%s")
        ("Google"            +lookup--online-backend-google "https://google.com/search?q=%s")
        ("Wikipedia"         "https://wikipedia.org/search-redirect.php?language=en&go=Go&search=%s")
        ("Singular Manual"   "https://www.google.com/search?q=site:www.singular.uni-kl.de+%s")
        ("Project Gutenberg" "http://www.gutenberg.org/ebooks/search/?query=%s")
        ;; ("DuckDuckGo"        +lookup--online-backend-duckduckgo "https://duckduckgo.com/?q=%s")
        ("DevDocs.io"        "https://devdocs.io/#q=%s")
        ("StackOverflow"     "https://stackoverflow.com/search?q=%s")
        ("Github"            "https://github.com/search?ref=simplesearch&q=%s")
        ("Youtube"           "https://youtube.com/results?aq=f&oq=&search_query=%s")
        ("Wolfram alpha"     "https://wolframalpha.com/input/?i=%s")
        ("Google images"     "https://www.google.com/images?q=%s")
        ("Google maps"       "https://maps.google.com/maps?q=%s")
        ))
#+end_src

#+RESULTS:
| Google            | +lookup--online-backend-google                                        | https://google.com/search?q=%s |
| Wikipedia         | https://wikipedia.org/search-redirect.php?language=en&go=Go&search=%s |                                |
| Singular Manual   | https://www.google.com/search?q=site:www.singular.uni-kl.de+%s        |                                |
| Project Gutenberg | http://www.gutenberg.org/ebooks/search/?query=%s                      |                                |
| DevDocs.io        | https://devdocs.io/#q=%s                                              |                                |
| StackOverflow     | https://stackoverflow.com/search?q=%s                                 |                                |
| Youtube           | https://youtube.com/results?aq=f&oq=&search_query=%s                  |                                |
| Google images     | https://www.google.com/images?q=%s                                    |                                |
| Google maps       | https://maps.google.com/maps?q=%s                                     |                                |

** Bindings
#+begin_src elisp
(map!
 ;; s- commands: commands executed several times AND in several distinct modes.
 "s-s"      #'save-buffer
 "s-w"      #'evil-window-next
 ;; "s-c"      #'close-quoted-open-paren-right-or-left-end-of-line
 "s-c"      #'close-quoted-open-paren-right-or-left
 ;; "s-SPC"    #'brust-cycle-whitespace ;; I am used to 'g SPC'
 "s-h"      #'recenter-top-bottom
 ;; "s-f"      #'flyspell-correct-previous ;; Learning to use z=
 ;; s- motion command
 "s-j"      #'evil-scroll-down
 "s-k"      #'evil-scroll-up
 ;; Cycling in kill-ring
 ;; "C-P"      #'brust-evil-paste-pop-backwards ;; see C-n
 "M-p"      #'counsel-yank-pop
 ;; :ier "M-i" #'evil-normal-state ;; it was tab-to-tab-stop
 ;; Now I use evil-escape (equivalent to key-chords jk kj) Press them a single key!

 ;; Normal mode workarounds (keep it to minimum)
 ;; :n "u"     #'emacs-undo ;; now undo works fine
 :nim "C-e" #'doom/forward-to-last-non-comment-or-eol
 :n "q"     #'kill-current-buffer
 :n "Q"     #'mark-whole-buffer ;; was undefined
 :i "C-,"   #'brust-correct-prev-spelling
 ;; :nvmro "w" #'evil-backward-word-begin
 ;; :nvmro "W" #'evil-backward-WORD-begin
 ;; :n "H"     #'recenter-top-bottom ;; There is no difference with s-h
 ;; More handy TABs (From Hlissner)
 :n [tab] (general-predicate-dispatch nil
            (fboundp 'evil-jump-item)
            #'evil-jump-item)

 :v [tab] (general-predicate-dispatch nil
            (and (bound-and-true-p yas-minor-mode)
                 (or (eq evil-visual-selection 'line)
                     (not (memq (char-after) (list ?\( ?\[ ?\{ ?\} ?\] ?\))))))
            #'yas-insert-snippet
            (fboundp 'evil-jump-item)
            #'evil-jump-item)

 ;; Personal extensions
 "<f2>"  #'brust-correct-prev-spelling
 "<f5>"  #'counsel-kmacro
 "<f9>"  #'mu4e
 "<f10>" #'magit-status
 :n "g SPC" #'brust-cycle-whitespace ;; It was unbind
 (:prefix "z"
  :n "j" #'brust-correct-prev-spelling
  :n "k" #'brust-correct-prev-spelling)
 (:leader
  :desc "locleader" "SPC" nil ;; Unbind "SPC SPC"
  :desc "Delete other windows" "w 0" #'delete-other-windows
  ;; :desc "Rotate anticlockwise" "w a" #'rotate-frame-anticlockwise
  ;; :desc "Switch buffer"              "b b" #'ivy-switch-buffer

  ;; My global bindings of Laura: functions used everywhere but not so often.
  (:prefix ("l" . "BMO")
   "n"    #'endless/narrow-or-widen-dwim
   "i"    #'endless/ispell-word-then-abbrev
   ;; "%"    #'vr/replace
   "%"    #'vr/query-replace
   "<f3>" #'kmacro-query-my
   ;; Zooming in emacs
   "1"    #'zoom-out ;; enlarge font
   "2"    #'zoom-in ;; reduce font
   (:prefix ("a" . "accents")
    ;; Easy Catala i Castella
    :desc "Insert ç" "c" (lambda nil (interactive) (insert "ç"))
    :desc "Insert Ç" "C" (lambda nil (interactive) (insert "Ç"))
    :desc "Insert ñ" "n" (lambda nil (interactive) (insert "ñ"))
    :desc "Insert Ñ" "N" (lambda nil (interactive) (insert "Ñ"))
    :desc "Insert à" "a" (lambda nil (interactive) (insert "à"))
    :desc "Insert À" "A" (lambda nil (interactive) (insert "À"))
    :desc "Insert è" "e" (lambda nil (interactive) (insert "è"))
    :desc "Insert È" "E" (lambda nil (interactive) (insert "È"))
    :desc "Insert é" "r" (lambda nil (interactive) (insert "é"))
    :desc "Insert É" "R" (lambda nil (interactive) (insert "É"))
    :desc "Insert í" "i" (lambda nil (interactive) (insert "í"))
    :desc "Insert Í" "I" (lambda nil (interactive) (insert "Í"))
    :desc "Insert ï" "k" (lambda nil (interactive) (insert "ï"))
    :desc "Insert Ï" "K" (lambda nil (interactive) (insert "Ï"))
    :desc "Insert ò" "o" (lambda nil (interactive) (insert "ò"))
    :desc "Insert Ò" "O" (lambda nil (interactive) (insert "Ò"))
    :desc "Insert ó" "p" (lambda nil (interactive) (insert "ó"))
    :desc "Insert Ó" "P" (lambda nil (interactive) (insert "Ó"))
    :desc "Insert ú" "u" (lambda nil (interactive) (insert "ú"))
    :desc "Insert Ú" "U" (lambda nil (interactive) (insert "Ú"))
    :desc "Insert ü" "j" (lambda nil (interactive) (insert "ü"))
    :desc "Insert Ü" "J" (lambda nil (interactive) (insert "Ü"))
    )))
 )
#+end_src

#+RESULTS:
| lambda | nil | (interactive) | (insert Ü) |

**** LaTeX

#+TITLE: 27 Cubics containing the reciprocal variety
#+AUTHOR: Laura Brustenga Moncusí
#+PROPERTY: header-args :eval never-export :cache no
#+PROPERTY: header-args+ :session *ob-ess-julia* :exports both
#+LATEX_HEADER: \usemintedstyle{tango}
#+LATEX_HEADER: \usepackage{polyglossia}
#+LATEX_HEADER: \setmonofont{DejaVu Sans Mono}[Scale=MatchLowercase]
#+LATEX_HEADER: \usepackage{unicode-math}
#+LATEX_HEADER: \renewcommand{\P}{\mathbb{P}} % Projective space
#+LATEX_HEADER: \renewcommand{\O}{\mathcal{O}}   % Calligraphic E
#+LATEX_HEADER: \renewcommand{\S}{\mathbb{S}}     % linear space of symmetric matrices
#+LATEX_HEADER: \newcommand{\Cat}{\mathrm{Cat}}   % Catalecticant matrix
#+LATEX_HEADER: \newcommand{\PGL}{\mathrm{PGL}}     % Projective general linear group
#+LATEX_HEADER: \newcommand{\Adj}{\mathrm{Adj}} % Adjugate matrix
#+OPTIONS: toc:nil
#+begin_src elisp
(after! org
  (setq org-latex-listings 'minted
        org-latex-packages-alist '(("" "minted"))
        org-latex-minted-langs '((ess-julia "julia")
                                 (julia-vterm "julia"))
        org-latex-pdf-process
        '("lualatex -shell-escape -interaction nonstopmode -output-directory %o %f"
          "lualatex -shell-escape -interaction nonstopmode -output-directory %o %f")
        org-latex-minted-options
        '(("breaklines" "")
          ;; ("escapeinside" "||")
          ("linenos" "")
          ("numbersep" "3pt")
          ("mathescape" "true")
          ;; ("gobble" "2")
          ("frame" "lines")
          ("framesep" "2mm")
          ;; ("fontsize" "\small")
          )))
#+end_src

#+RESULTS:
| breaklines |       |
| linenos    |       |
| numbersep  | 3pt   |
| mathescape | true  |
| frame      | lines |
| framesep   | 2mm   |

**** Rich
Enlarge width of some columns
#+begin_src elisp
(after! ivy
  (let* ((plist (plist-get ivy-rich-display-transformers-list 'ivy-switch-buffer))
         (switch-buffer-alist (assq 'ivy-switch-buffer-transformer (plist-get plist :columns))))
    (when switch-buffer-alist
      (setcdr switch-buffer-alist '((:width 80)))))

  (let* ((plist (plist-get ivy-rich-display-transformers-list 'counsel-M-x))
         (switch-buffer-alist (assq 'counsel-M-x-transformer (plist-get plist :columns))))
    (when switch-buffer-alist
      (setcdr switch-buffer-alist '((:width 50)))))
  )
#+end_src

#+RESULTS:
| :width | 50 |

*** Zoom
#+begin_src elisp
(use-package! zoom
  :defer t
  :init
  (setq zoom-size '(0.618 . 0.618)
        zoom-ignored-major-modes '("dired-mode"
                                   "ediff-mode"
                                   ;; "eshell-mode"
                                   ;; "neotree-mode"
                                   "sr-speedbar-mode")
        zoom-ignored-buffer-name-regexps '("^*calc" "^\\*magit: +.*"))
  (add-hook! 'emacs-startup-hook (zoom-mode +1)))

(after! ediff
  (add-hook! 'ediff-before-setup-hook (zoom-mode -1))
  (add-hook! 'ediff-cleanup-hook (zoom-mode +1))
  )
#+end_src

#+RESULTS:
| brust-zoom-on |

